var tavernMenuType;
var tavernMenuTypeWording = ["гарно", "звичайно", "бідно"];
var tavernMenuWine = ["Відмінне вино, пляшка - 2 зм</li><li>Звичайне вино, глек - 2 см", "Звичайне вино, пляшка - 8 см</li><li>Звичайне вино, глек - 2 см", "Старе вино, пляшка - 2 см</li><li>Вино, глек - 2 мм"];
var tavernMenuBeer = ["Відмінне пиво, галон - 5 см</li><li>Відмінне пиво, кружка - 1 см","Звичайне пиво, галон - 2 см</li><li>Звичайне пиво, кружка - 4 мм", "Старе вино, пляшка - 2 см</li><li>Вино, глек - 2 мм"];
var tavernMenuBread = ["Білий хліб, шматок - 1 см", "Сірий хліб, шматок - 2 мм", "Хліб, шматок - 1мм"];
var tavernMenuCheese = ["Свіжий сир - 2 см", "Сир - 1 см", "Старий сир - 5 см"];
var tavernMenuLivingCost = ["2 золотих", "8 срібних", "1 срібна"];
var tavernMenuLivingCostAdditional = ["", "", ", на багато не розраховуйте"];
var tavernMenuFood = ["8 см", "5 см", "6 мм"];
//cost in copper coins with two leading zeroes
var tavernMenuFirst = ["Смажена курка (ціла), 020", "Смажена курка (ніжка), 010", "Суп грибний (тарілка), 010", "М'ясний пиріг (тарілка), 015", "М'ясний рулет (відріз), 020", "Бульйон (тарілка), 025"];
var tavernMenuSecond = ["", "", "", "", "", "", "", "", "", ""];
var tavernMenuThird = ["", "", "", "", "", "", "", "", "", ""];
var tavernMenuDrink = ["вино (кухоль)015", "вино (глек)040", "пиво (галон)020", "пиво (кухоль)004", "відмінне пиво (кухоль)010", "ель (кухоль)025", "джин (кухоль)030"];
