var personSex = ['1', '0'];
var personSexEnding;
var tavernName = ['шинка', 'корчми', 'таверни', 'гостинного двору']
var personAdverb = ["кремезн", "висок", "міцн", "усміхнен", "гарн", "невисок", "задумлив", ""];
var personRace;
var personRaceNumber;
var personRaceMale = ["чоловік", "ельф", "дверг", "напіврослик"];
var personRaceFemale = ["жінка", "ельфійка", "двергиня", "напіврослиця"];
var personName;
var personNameMaleHuman = ["Козеф", "Хасеід", "Со-Кехур", "Мадіслак", "Салазар"];
var personNameMaleDwarf = ["Адрік","Альберіх","Баерн","Бренор", "Вейт", "Вондал","Ґардаін","Даррак", "Даін", "Делґар", "Еберк", "Ейнкіль", "Кілдрак", "Морґран", "Оскар", "Ранґрім", "Рюрик", "Торін", "Травок", "Траубон", "Ульфґар", "Фарґрім"];
var personNameMaleElf = ["Аелар", "Араміль", "Аранніс", "Бейро", "Берріан", "Варіс", "Еніаліс", "Ердан", "Ереван", "Іммераль", "Каррік", "Куаріон", "Перен", "Ролен", "Ріардон", "Совелісс", "Таміорн", "Тарівол", "Хейян", "Хімо"];
var personNameMaleHalfling = ["Альтон", "Андер", "Гаррет", "Елдон", "Ерріх", "Кейд", "Коррін", "Лайл", "Ліндал", "Майло", "Меррік", "Осборн", "Перрін", "Рід", "Роско"];
var personNameFemaleHuman = ["Амафрея","Керрі","Мей"];
var personNameFemaleDwarf = ["Артін", "Бардрін", "Вістра", "Ґуннлода", "Ґурдіс", "Даґнал", "Дієза", "Ельдет", "Ембер", "Катра", "Крістід", "Ліфтраса", "Мардред", "Одхільда", "Рісвін", "Саннл", "Торбера", "Торґа", "Фалкрунн", "Фінеллі", "Хлін", "Ілдея"];
var personNameFemaleElf = ["Альтеа", "Антінуа", "Бетрінна", "Бірель", "Ваданія", "Валанта", "Енна", "Єлена", "Каелінн", "Квеленна", "Ксанафія", "Лешану", "Ліа", "Міалі", "Меріель", "Найвара", "Саріель", "Сілакві", "Теїрастра", "Шава"];
var personNameFemaleHalfling = ["Брі", "Вані", "Верна", "Джилліан", "Ендрю", "Кітрі", "Кора", "Келлі", "Лавінія", "Лідда", "Мерла", "Недда", "Паелія", "Портія", "Серафіна", "Трім", "Шаена", "Юфемія"];

